% 这个脚本用来预测缙云中学2021届学生选考科目数据
%二维数组P  Pij存储数据i表示年份 j表示科目
P=[57.36	54.97	61.89	39.75	40.38	41.13	4.28;...
    49.20	58.00	60.08	29.60	40.00	35.20	23.12;...
    13.34	52.86	64.04	40.47	45.23	27.21	57.02;...
    17.88	33.50	65.16	47.37	68.67	35.09	32.33]*0.01;
%x表示年份
x=[1 2 3 4];
%w表示权重
w=[0.2 0.3 1.6 1.8];
%系数矩阵
a11=w*x';
a12=sum(w);
a21=w*(x.*x)';
a22=w*x';

%化学
P2=[P(1,2) P(2,2) P(3,2) P(4,2)];


b1=w*P2';
b2=0;
for i=1:4
    b2=b2+P2(i)*x(i)*w(i);
end
A2=inv([a11,a12;a21,a22])*[b1;b2];
PP2=5*A2(1)+A2(2);

%生物
P3=[P(1,3) P(2,3) P(3,3) P(4,3)];
b1=w*P3';
b2=0;
for i=1:4
    b2=b2+P3(i)*x(i)*w(i);
end
A3=inv([a11,a12;a21,a22])*[b1;b2];
PP3=5*A3(1)+A3(2);
%政治
P4=[P(1,4) P(2,4) P(3,4) P(4,4)];
b1=w*P4';
b2=0;
for i=1:4
    b2=b2+P4(i)*x(i)*w(i);
end
A4=inv([a11,a12;a21,a22])*[b1;b2];
PP4=5*A4(1)+A4(2);
%历史
P5=[P(1,5) P(2,5) P(3,5) P(4,5)];
b1=w*P5';
b2=0;
for i=1:4
    b2=b2+P5(i)*x(i)*w(i);
end
A5=inv([a11,a12;a21,a22])*[b1;b2];
PP5=5*A5(1)+A5(2);
%地理
P6=[P(1,6) P(2,6) P(3,6) P(4,6)];
b1=w*P6';
b2=0;
for i=1:4
    b2=b2+P6(i)*x(i)*w(i);
end
A6=inv([a11,a12;a21,a22])*[b1;b2];
PP6=5*A6(1)+A6(2);
%技术
P7=[P(1,7) P(2,7) P(3,7) P(4,7)];
b1=w*P7';
b2=0;
for i=1:4
    b2=b2+P7(i)*x(i)*w(i);
end
A7=inv([a11,a12;a21,a22])*[b1;b2];
PP7=5*A7(1)+A7(2);

%物理 由于物理选课人数1718届与1920届差别太大，
%因此，基于潮流核政策趋势考虑，将其取为0.2
PP1=0.2;
%修正
SUM=PP1+PP2+PP3+PP4+PP5+PP6+PP7;
PPP1=3*PP1/SUM;
PPP2=3*PP2/SUM;
PPP3=3*PP3/SUM;
PPP4=3*PP4/SUM;
PPP5=3*PP5/SUM;
PPP6=3*PP6/SUM;
PPP7=3*PP7/SUM;
PR=['选考物理总人数：',num2str(round(1147*PPP1)),'\n',...
'选考化学总人数：',num2str(round(1147*PPP2)),'\n',...    
'选考生物总人数：',num2str(round(1147*PPP3)),'\n',...
'选考政治总人数：',num2str(round(1147*PPP4)),'\n',...
'选考历史总人数：',num2str(round(1147*PPP5)),'\n',...
'选考地理总人数：',num2str(round(1147*PPP6)),'\n',...
'选考技术总人数：',num2str(round(1147*PPP7)),];
fprintf(PR);